## Introduction to Dataset Processing
#### by Carl Shan and Jen Selby

This Jupyter Notebook will share more details about how to process your data. 

Data processing is like preparing the ingredients before cooking; if you prepare them poorly (e.g., leave things half-peeled and dirty) , the meal will taste poor no matter how skillful a chef you are. 

It's similarly true in machine learning. Dataset processing can be one of the most important things you can do to get your model to perform well.

You can read more about dataset processing on the [course notes here](https://jennselby.github.io/MachineLearningCourseNotes/#data-processing).

### Hint: Use the `?` symbol

As you go through this notebook, as well as learn more about processing data in iPython, it will be helpful to know the `?` symbol.

E.g., You can try to type the following into Python

```python
import sklearn

sklearn?
```

Typing the `?` symbol after a function, module or variable will bring up the documentation of that bit of code, assuming it exists. It'll tell you more about the variable, function or module.

## Dataset processing: Setup

In [1]:
import pandas as pd
from sklearn import preprocessing

Download the [student performance data](http://archive.ics.uci.edu/ml/machine-learning-databases/00320/) and change the path below to wherever you put the data.

In [2]:
student_data = pd.read_csv('data/student/student-mat.csv', sep=';')

In [3]:
student_data.head()

,school,sex,age,address,famsize,Pstatus,Medu,Fedu,Mjob,Fjob,...,famrel,freetime,goout,Dalc,Walc,health,absences,G1,G2,G3
0,GP,F,18,U,GT3,A,4,4,at_home,teacher,...,4,3,4,1,1,3,6,5,6,6
1,GP,F,17,U,GT3,T,1,1,at_home,other,...,5,3,3,1,1,3,4,5,5,6
2,GP,F,15,U,LE3,T,1,1,at_home,other,...,4,3,2,2,3,3,10,7,8,10
3,GP,F,15,U,GT3,T,4,2,health,services,...,3,2,2,1,1,5,2,15,14,15
4,GP,F,16,U,GT3,T,3,3,other,other,...,4,3,2,1,2,5,4,6,10,10

## Section 1: Converting Categorical Values to Numerical Ones

Looking at the data above, we want to convert a number of the columns from categorical to numerical. Most machine learning models deal with numbers and don't know how to model data that is in text form. As a result we need to learn how to do things such as e.g., convert the values in the `school` column to numbers.

### First, let's see what values there are in the `school` column

In [4]:
# This shows a list of unique values and how many times they appear
student_data['school'].value_counts()

GP    349
MS     46
Name: school, dtype: int64

In [5]:
# Converting values in the school column to text
# We are going to define a function that takes a single value and apply it to all the values
def convert_school(row):
    if row == 'GP':
        return 0
    elif row == 'MS':
        return 1
    else:
        return None

### Avoid for loops
Normally, we might write a for loop like the one below. But this is really slow when using Pandas.

### _Don't write loops like this_.

In [6]:
# Here's a slow way of using the above function
%time
converted_school = []

for row in student_data['school']:
    new_value = convert_school(row)
    converted_school.append(new_value)
converted_school


# Don't do this! It's very slow.

CPU times: user 2 µs, sys: 0 ns, total: 2 µs
Wall time: 3.81 µs

[0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 0,
 1,
 1,
 1,
 1,
 1,
 1,
 1,
 1,
 1,
 1,
 1,
 1,
 1,
 1,
 1,
 1,
 1,
 1,
 1,
 1,
 1,
 1,
 1,
 1,
 1,
 1,
 1,
 1,
 1,
 1,
 1,
 1,
 1,
 1,
 1,
 1,
 1,
 1,
 1,
 1,
 1,
 1,
 1,
 1,
 1,
 1]

### Instead, Use `.apply`
This will do the same thing as the for loop above, but _much_ faster. It'll apply a function to all the rows of a `DataFrame`.

In [7]:
%time
converted_school = student_data['school'].apply(convert_school)
converted_school

CPU times: user 3 µs, sys: 0 ns, total: 3 µs
Wall time: 7.15 µs

0      0
1      0
2      0
3      0
4      0
      ..
390    1
391    1
392    1
393    1
394    1
Name: school, Length: 395, dtype: int64

Look how much faster that took!

### Or, you can use `.map()`

You can also use the `.map()` function to map certain values to other data.

For example, imagine you had a column named `'colors'` that contained the values `"red"` and `"blue"` and you wanted to convert these to the numbers `1` and `2`.

```python

mappings = {
    'red': 1,
    'blue': 2
}

data['colors_mapped'] = data['colors'].map(mappings)

```

The above will create a new column called `colors_mapped` that now has the values `1` and `2`.

### Using sklearn's built-in preprocessing module, we can do the same thing

In [8]:
enc_school = preprocessing.LabelEncoder()
transformed_school = enc_school.fit_transform(student_data['school'])
transformed_school

array([0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1,
       1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
       1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1])

### We can also use one-hot encoding if we have more than two values. We still need to encode it first, as we did above.
See example at https://stackoverflow.com/a/43589167/2159992

In [9]:
enc_mjob = preprocessing.LabelEncoder()
encoded_mjob = enc_mjob.fit_transform(student_data['Mjob'])
encoded_mjob

array([0, 0, 0, 1, 2, 3, 2, 2, 3, 2, 4, 3, 1, 4, 2, 1, 3, 2, 3, 1, 4, 1,
       4, 2, 3, 3, 2, 1, 3, 4, 1, 3, 4, 2, 2, 2, 4, 2, 3, 0, 2, 4, 3, 3,
       2, 2, 2, 1, 4, 3, 3, 1, 1, 3, 2, 2, 3, 4, 2, 3, 1, 3, 2, 4, 3, 4,
       2, 3, 1, 2, 2, 2, 2, 2, 2, 4, 4, 2, 2, 0, 2, 2, 3, 3, 2, 3, 0, 2,
       3, 4, 2, 3, 2, 4, 3, 0, 3, 2, 2, 2, 3, 3, 3, 3, 3, 2, 2, 3, 2, 1,
       4, 3, 0, 4, 1, 4, 2, 2, 2, 2, 0, 3, 2, 1, 2, 3, 2, 0, 3, 4, 3, 0,
       2, 3, 0, 3, 0, 2, 3, 4, 4, 3, 4, 0, 2, 2, 1, 0, 4, 3, 2, 0, 3, 3,
       2, 0, 2, 0, 0, 2, 0, 2, 2, 0, 2, 3, 2, 1, 2, 1, 2, 2, 4, 0, 2, 4,
       3, 2, 4, 2, 4, 3, 3, 2, 2, 3, 3, 2, 1, 0, 3, 0, 0, 3, 2, 3, 3, 4,
       3, 4, 1, 2, 2, 2, 3, 0, 3, 4, 0, 4, 2, 3, 2, 3, 3, 2, 2, 3, 0, 0,
       0, 0, 3, 2, 4, 2, 2, 3, 0, 2, 1, 2, 4, 1, 2, 0, 2, 2, 0, 2, 1, 4,
       4, 3, 2, 2, 2, 3, 2, 2, 3, 0, 3, 2, 2, 1, 4, 3, 2, 3, 3, 4, 2, 2,
       0, 2, 3, 4, 1, 2, 2, 2, 2, 0, 0, 3, 2, 4, 1, 4, 3, 4, 0, 2, 2, 2,
       0, 3, 3, 4, 4, 1, 3, 3, 3, 1, 1, 2, 2, 4, 1, 2, 2, 1, 2, 3, 3, 4,
       2, 0, 3, 0, 2, 3, 0, 2, 3, 2, 0, 4, 3, 2, 3, 3, 0, 2, 2, 3, 4, 4,
       2, 0, 3, 2, 0, 3, 3, 2, 3, 2, 3, 4, 3, 0, 0, 2, 4, 4, 1, 2, 2, 1,
       0, 2, 3, 3, 4, 3, 2, 0, 0, 0, 3, 0, 2, 0, 4, 2, 0, 2, 3, 0, 2, 2,
       2, 2, 1, 4, 2, 0, 4, 2, 2, 2, 2, 0, 4, 3, 4, 2, 3, 3, 2, 3, 2])

In [10]:
onehot_mjob = preprocessing.OneHotEncoder(sparse=False)
transformed_mjob = onehot_mjob.fit_transform(encoded_mjob.reshape(-1,1))
transformed_mjob

/Library/Frameworks/Python.framework/Versions/3.7/lib/python3.7/site-packages/sklearn/preprocessing/_encoders.py:415: FutureWarning: The handling of integer data will change in version 0.22. Currently, the categories are determined based on the range [0, max(values)], while in the future they will be determined based on the unique values.
If you want the future behaviour and silence this warning, you can specify "categories='auto'".
In case you used a LabelEncoder before this OneHotEncoder to convert the categories to integers, then you can now use the OneHotEncoder directly.
  warnings.warn(msg, FutureWarning)

array([[1., 0., 0., 0., 0.],
       [1., 0., 0., 0., 0.],
       [1., 0., 0., 0., 0.],
       ...,
       [0., 0., 1., 0., 0.],
       [0., 0., 0., 1., 0.],
       [0., 0., 1., 0., 0.]])

Once we've fitted the label encoder and one-hot encoder, we can use them to transform more values.

In [11]:
onehot_mjob.transform(enc_mjob.transform(['other', 'health']).reshape(-1,1))

array([[0., 0., 1., 0., 0.],
       [0., 1., 0., 0., 0.]])

### What if we want to apply a transform that looks at multiple values in the row?
For instance, what if we want to create a new column with a 1 if both parents have the highest level of education measured?

In [12]:
student_data['health']

0      3
1      3
2      3
3      5
4      5
      ..
390    4
391    2
392    3
393    5
394    5
Name: health, Length: 395, dtype: int64

In [13]:
medu_index = student_data.columns.get_loc('Medu')
fedu_index = student_data.columns.get_loc('Fedu')

def both_parents_edu(row):
    if row[medu_index] > 3 and row[fedu_index] >= 4:
        return 1
    else:
        return 0
    
# axis 1 means that we will apply the function to each row
student_data['parents_high_edu'] = student_data.apply(both_parents_edu, axis=1)
student_data.head(10)

,school,sex,age,address,famsize,Pstatus,Medu,Fedu,Mjob,Fjob,...,freetime,goout,Dalc,Walc,health,absences,G1,G2,G3,parents_high_edu
0,GP,F,18,U,GT3,A,4,4,at_home,teacher,...,3,4,1,1,3,6,5,6,6,1
1,GP,F,17,U,GT3,T,1,1,at_home,other,...,3,3,1,1,3,4,5,5,6,0
2,GP,F,15,U,LE3,T,1,1,at_home,other,...,3,2,2,3,3,10,7,8,10,0
3,GP,F,15,U,GT3,T,4,2,health,services,...,2,2,1,1,5,2,15,14,15,0
4,GP,F,16,U,GT3,T,3,3,other,other,...,3,2,1,2,5,4,6,10,10,0
5,GP,M,16,U,LE3,T,4,3,services,other,...,4,2,1,2,5,10,15,15,15,0
6,GP,M,16,U,LE3,T,2,2,other,other,...,4,4,1,1,3,0,12,12,11,0
7,GP,F,17,U,GT3,A,4,4,other,teacher,...,1,4,1,1,1,6,6,5,6,1
8,GP,M,15,U,LE3,A,3,2,services,other,...,2,2,1,1,1,0,16,18,19,0
9,GP,M,15,U,GT3,T,3,4,other,other,...,5,1,1,1,5,0,14,15,15,0

## Section 2: Dealing with Text Data

`pandas` has a lot of built-in modules that work with text-based data. 

`sklearn` similarly has a lot of modules for this as well.

This section gives a brief outline of the things you can try.

If you want to see a fuller list, with examples, of how `pandas` deals with text data, you can look at [the documentation here](https://pandas.pydata.org/pandas-docs/stable/text.html).

In [14]:
#### First, I'm going to make some fake data that we can work with for the rest of this section

data = pd.DataFrame(data={'text': ['apple', '%badly,formatted,data%', 'pear']})

In [15]:
data

                     text
0                   apple
1  %badly,formatted,data%
2                    pear

### Removing or replacing data

Okay, we want to remove the `','` and `'%'` symbols from the data. How do we do so?

In [16]:
data['text_removed'] = data['text'].str.replace(',', '')

In [17]:
data

                     text          text_removed
0                   apple                 apple
1  %badly,formatted,data%  %badlyformatteddata%
2                    pear                  pear

Nice. Now try and replace the `'%'` symbols.

In [18]:
#### Your code here

data['text_removed'] = data['text'].str.replace(',', '').str.replace('%', '')
data

                     text        text_removed
0                   apple               apple
1  %badly,formatted,data%  badlyformatteddata
2                    pear                pear

### Checking to see if a string contains a certain value

Now, we want to see if a text contains certain values, and only get the rows that contains those values.

In [19]:
### Again, I have to make some fake data

data = pd.DataFrame(data={'text': ['Nueva Maverick', 'San Francisco Maverick', 'Vikings']})

In [20]:
data

                     text
0          Nueva Maverick
1  San Francisco Maverick
2                 Vikings

Cool, what if we only wanted to get the rows that contained the word `'Maverick'`?

In [21]:
data['text'].str.contains('Maverick')

0     True
1     True
2    False
Name: text, dtype: bool

Now we can use this `Series` of `boolean` `True` and `False` values to index into our data!

In [22]:
condition = data['text'].str.contains('Maverick')

filtered_data = data[condition]

In [23]:
filtered_data

                     text
0          Nueva Maverick
1  San Francisco Maverick

### There is a whole list of other things you can do with your text data. 

**Some are listed below:**

* `str.startswith()` and `str.endswith()` - checks to see if a string starts or ends with a given argument
* `str.count()` - counts the number of appearances of a certain pattern
* `str.numeric()` - checks to see if the string is numeric (e.g., `23123` is a digit whereas `213123abc` is not)
* `str.split()` - splits the string on some deliminter and returns a dataframe of the string, split on the characters.

There's plenty more and you can see the [documentation here for more](https://pandas.pydata.org/pandas-docs/stable/text.html).

### What about transforming text data into a DataFrame?

In [24]:
raw_text = ["""This is a giant series of sentences that you want to convert into a DataFrame containing 
the raw counts for each word. There are some abbr. and some punctuations here and there that make things more complicated.
So how in the world do we turn this into something that we can build a machine learning model off of?
"""]

Okay, so we want to turn the above into a DataFrame where every column is a different word, and each entry stores the number of times that word came up.

We're going to use the `CountVectorizer` class in `sklearn`.

A more [in-depth tutorial on how to use it, and more, can be found here](https://machinelearningmastery.com/prepare-text-data-machine-learning-scikit-learn/).

In [25]:
from sklearn.feature_extraction.text import CountVectorizer

In [26]:
# Initializing an empty CountVectorizer object
count_vect = CountVectorizer()

In [27]:
# Now we fit the object to our actual data
counts = count_vect.fit_transform(raw_text)

In [28]:
# This is a `sparse matrix` class. It saves our computer space.
counts

<1x45 sparse matrix of type '<class 'numpy.int64'>'
	with 45 stored elements in Compressed Sparse Row format>

In [29]:
# Let's use the `.todense()` function to turn this sparse matrix 
#into something that can be transformed into a DataFrame
word_counts_df = pd.DataFrame(data=counts.todense())

In [30]:
word_counts_df

,0,1,2,3,4,5,6,7,8,9,...,35,36,37,38,39,40,41,42,43,44
0,1,2,1,1,1,1,1,1,1,1,...,2,1,2,1,1,1,2,1,1,1

Great, but what do each of the columns mean?

We can inspect the `count_vect.vocabulary_` attribute to find out.

In [31]:
count_vect.vocabulary_

{'this': 37,
 'is': 18,
 'giant': 13,
 'series': 29,
 'of': 24,
 'sentences': 28,
 'that': 33,
 'you': 44,
 'want': 40,
 'to': 38,
 'convert': 7,
 'into': 17,
 'dataframe': 9,
 'containing': 6,
 'the': 34,
 'raw': 27,
 'counts': 8,
 'for': 12,
 'each': 11,
 'word': 42,
 'there': 35,
 'are': 2,
 'some': 31,
 'abbr': 0,
 'and': 1,
 'punctuations': 26,
 'here': 14,
 'make': 21,
 'things': 36,
 'more': 23,
 'complicated': 5,
 'so': 30,
 'how': 15,
 'in': 16,
 'world': 43,
 'do': 10,
 'we': 41,
 'turn': 39,
 'something': 32,
 'can': 4,
 'build': 3,
 'machine': 20,
 'learning': 19,
 'model': 22,
 'off': 25}

Great. Now we know the words for each of the datasets

**Your challenge**: Your challenge is to write some code so that you end converting the columns in `word_counts_df` to each of the words in `count_vect.vocabulary_`.

In [32]:
# If you're successful it should look like the output below.

In [33]:
### Your code here
word_counts_df.rename(columns={value: key for key, value in count_vect.vocabulary_.items()})

,abbr,and,are,build,can,complicated,containing,convert,counts,dataframe,...,there,things,this,to,turn,want,we,word,world,you
0,1,2,1,1,1,1,1,1,1,1,...,2,1,2,1,1,1,2,1,1,1

## Section 3: Dealing with Null values
To show you how to deal with null values, I'm going to make some simulated data of students.

In [34]:
import numpy as np
grades = np.random.choice(range(1, 13), 100) # chooses 100 random numbers between 1 - 12
num_friends_or_none = list(range(0, 20)) + [None] * 5
num_friends = np.random.choice(num_friends_or_none, 100)
new_data = pd.DataFrame(data={'Grade': grades, '# Friends': num_friends})

In [35]:
new_data.head(n=20)

    Grade # Friends
0       5      None
1       9      None
2       6         2
3      12        14
4      10         7
5       1         7
6      12         1
7       6      None
8      11         0
9       1      None
10      6        16
11     11        10
12     12      None
13      9        11
14      9        16
15     11         1
16      4         3
17      4         8
18      8         3
19     10         1

#### One way to deal with null values is to drop them

In [36]:
new_data['# Friends'].dropna()

2      2
3     14
4      7
5      7
6      1
      ..
95     3
96    17
97    13
98    16
99     0
Name: # Friends, Length: 75, dtype: object

#### We can also drop any rows with nulls from the entire table.

In [37]:
new_data.dropna()

    Grade # Friends
2       6         2
3      12        14
4      10         7
5       1         7
6      12         1
..    ...       ...
95      6         3
96     10        17
97     10        13
98      1        16
99      3         0

[75 rows x 2 columns]

#### Or we can replace the null values with an average

In [38]:
average_friends = new_data['# Friends'].mean()
new_data['# Friends'].fillna(average_friends)

0      8.92
1      8.92
2      2.00
3     14.00
4      7.00
      ...
95     3.00
96    17.00
97    13.00
98    16.00
99     0.00
Name: # Friends, Length: 100, dtype: float64

In [39]:
new_data['# Friends'] = new_data['# Friends'].fillna(average_friends)

#### What if instead of null values, there is something else that stands for missing values?
Try the replace function.

In [40]:
grades = np.random.choice(range(1, 13), 100) # chooses 100 random numbers between 1 - 12
num_friends_or_none = list(range(0, 20)) + ["Unknown"] * 5
num_friends = np.random.choice(num_friends_or_none, 100)
unknown_data = pd.DataFrame(data={'Grade': grades, '# Friends': num_friends})
unknown_data

    Grade # Friends
0       6         1
1       9         1
2       9        15
3       5        14
4      11        16
..    ...       ...
95     10   Unknown
96     11        10
97      9        19
98      7        14
99      4        13

[100 rows x 2 columns]

In [41]:
unknown_data.replace("Unknown", 10)

    Grade # Friends
0       6         1
1       9         1
2       9        15
3       5        14
4      11        16
..    ...       ...
95     10        10
96     11        10
97      9        19
98      7        14
99      4        13

[100 rows x 2 columns]

## Section 4: Now let's learn how to standardize data
By that I mean to transform our data so that it has a mean of 0 and a standard deviation of 1.

Why would we want to do this?


Well often we will have strange parameter estimates on many models models if different bits of our data are in wildly different ranges.


> Many researchers have noted the importance of standardizing variables for multivariate analysis. 
>
> Otherwise, variables measured at different scales do not contribute equally to the analysis. 

>For example, in boundary detection, a variable that ranges between 0 and 100 will outweigh a variable that ranges between 0 and 1. Using these variables without standardization in effect gives the variable with the larger range a weight of 100 in the analysis. 

>Transforming the data to comparable scales can prevent this problem. Typical data standardization procedures equalize the range and/or data variability.

[Source](https://www.biomedware.com/files/documentation/Preparing_data/Why_standardize_variables.htm)

In [42]:
from sklearn.preprocessing import StandardScaler

In [43]:
scaler = StandardScaler()

In [44]:
scaler.fit_transform(new_data)

array([[-0.47105064,  0.        ],
       [ 0.74456392,  0.        ],
       [-0.167147  , -1.40682956],
       [ 1.65627485,  1.03275928],
       [ 1.04846756, -0.39033421],
       [-1.68666521, -0.39033421],
       [ 1.65627485, -1.61012863],
       [-0.167147  ,  0.        ],
       [ 1.3523712 , -1.8134277 ],
       [-1.68666521,  0.        ],
       [-0.167147  ,  1.43935742],
       [ 1.3523712 ,  0.219563  ],
       [ 1.65627485,  0.        ],
       [ 0.74456392,  0.42286207],
       [ 0.74456392,  1.43935742],
       [ 1.3523712 , -1.61012863],
       [-0.77495429, -1.20353049],
       [-0.77495429, -0.18703514],
       [ 0.44066028, -1.20353049],
       [ 1.04846756, -1.61012863],
       [-0.167147  ,  0.01626393],
       [-1.38276157, -0.59363328],
       [ 1.3523712 , -0.79693235],
       [-0.47105064,  0.01626393],
       [ 0.74456392,  0.219563  ],
       [ 0.13675664,  0.        ],
       [ 0.13675664,  0.219563  ],
       [-0.47105064,  1.23605835],
       [-1.38276157, -1.8134277 ],
       [ 1.04846756,  1.64265649],
       [-0.77495429,  0.        ],
       [-1.68666521, -0.39033421],
       [-1.38276157,  0.        ],
       [ 0.74456392,  0.        ],
       [-1.68666521, -1.61012863],
       [ 1.65627485,  0.        ],
       [-0.47105064, -0.59363328],
       [ 1.65627485, -1.20353049],
       [ 0.13675664,  0.62616114],
       [ 0.44066028,  0.82946021],
       [-1.38276157, -1.61012863],
       [ 0.44066028, -0.59363328],
       [-0.167147  , -0.59363328],
       [-0.47105064,  0.        ],
       [-0.47105064, -0.39033421],
       [ 0.44066028,  2.04925462],
       [-1.68666521,  1.43935742],
       [ 1.3523712 ,  1.84595556],
       [-0.47105064, -1.61012863],
       [-0.47105064, -0.59363328],
       [ 0.74456392,  1.03275928],
       [-1.68666521,  0.        ],
       [-0.47105064, -1.40682956],
       [-1.68666521, -0.39033421],
       [ 1.65627485,  1.03275928],
       [-0.167147  ,  1.64265649],
       [-0.47105064,  1.23605835],
       [ 1.04846756,  0.42286207],
       [-1.07885793, -0.39033421],
       [ 0.13675664,  1.43935742],
       [-1.38276157, -1.20353049],
       [-0.167147  , -0.39033421],
       [ 1.3523712 ,  0.62616114],
       [-0.47105064,  0.62616114],
       [-0.47105064,  0.        ],
       [ 0.74456392, -0.59363328],
       [-0.77495429,  0.        ],
       [ 0.44066028, -1.00023142],
       [-1.38276157,  0.        ],
       [-0.77495429,  1.64265649],
       [-1.07885793,  0.        ],
       [ 0.74456392,  0.        ],
       [ 0.74456392, -1.61012863],
       [ 1.3523712 ,  0.219563  ],
       [-0.47105064,  1.23605835],
       [-1.07885793,  0.        ],
       [ 0.44066028,  0.        ],
       [ 1.3523712 ,  1.84595556],
       [-0.47105064,  1.23605835],
       [ 0.44066028,  2.04925462],
       [ 0.44066028, -0.79693235],
       [-0.47105064, -1.20353049],
       [-0.77495429,  0.42286207],
       [ 1.04846756,  0.        ],
       [ 0.13675664,  0.01626393],
       [ 1.65627485,  0.82946021],
       [-0.77495429,  0.        ],
       [-1.38276157,  0.219563  ],
       [ 0.74456392, -1.61012863],
       [-0.167147  ,  0.        ],
       [ 0.13675664,  1.23605835],
       [-0.47105064, -0.18703514],
       [-0.77495429,  0.        ],
       [ 1.3523712 ,  0.        ],
       [-0.167147  ,  0.        ],
       [-0.167147  , -1.20353049],
       [ 1.04846756,  1.64265649],
       [ 1.04846756,  0.82946021],
       [-1.68666521,  1.43935742],
       [-1.07885793, -1.8134277 ]])

The above will transform the data so that all the columns have an average of 0 and a standard deviation of 1.

You can read the full documentatio for the `StandardScaler` [here](http://scikit-learn.org/stable/modules/generated/sklearn.preprocessing.StandardScaler.html).

## Bonus: What if we would like to split up columns?

Maybe  you have data in a column that's a mashup between multiple values.

For example, imagine if you have a column that stores values like:

`'8th Grade - 13 years old'` and `'12th grade - 17 years old'` and you want to create two columns: `grade` and `age` to store the two separate bits of data.

How do you do so?

In [45]:
# I'm going to generate some fake data here. Ignore the below>
grades = np.random.choice(range(1, 13), 100) # chooses 100 random numbers between 1 - 12
grades_and_ages = ['Grade {grade}  - {age} years old'.format(grade=grade, age=grade+6) for grade in grades]
num_friends_or_none = list(range(0, 20)) + ["Unknown"] * 5
num_friends = np.random.choice(num_friends_or_none, 100)
combined_data = pd.DataFrame(data={'Grade and Age': grades_and_ages, '# Friends': num_friends})

In [47]:
combined_data

               Grade and Age # Friends
0    Grade 9  - 15 years old         4
1    Grade 5  - 11 years old         1
2     Grade 2  - 8 years old         8
3    Grade 5  - 11 years old        10
4    Grade 7  - 13 years old        18
..                       ...       ...
95  Grade 10  - 16 years old        17
96  Grade 10  - 16 years old        13
97  Grade 10  - 16 years old        13
98  Grade 10  - 16 years old         6
99  Grade 11  - 17 years old         6

[100 rows x 2 columns]

Awesome, now let's split things up. We'll use the built in `.str.split()` function with the extra input `expand=True`.

The `expand=True` will convert the splitted data into a `DataFrame` instead of keeping a list of values. 

(Try taking out `expand=True` and seeing what happens.)

In [48]:
combined_data['Grade and Age'].str.split(' - ', expand=True)

            0             1
0    Grade 9   15 years old
1    Grade 5   11 years old
2    Grade 2    8 years old
3    Grade 5   11 years old
4    Grade 7   13 years old
..        ...           ...
95  Grade 10   16 years old
96  Grade 10   16 years old
97  Grade 10   16 years old
98  Grade 10   16 years old
99  Grade 11   17 years old

[100 rows x 2 columns]

**Your challenge**: Write some code that does the following:

1. Removes the words 'Grade' and 'years old' from the data
2. Takes these two columns and puts them back into the original `combined_data` DataFrame.

In [52]:
### Your code here

both = combined_data['Grade and Age'].str.split(' - ', expand=True)

# both[0].str.replace('Grade ', '')
# both[1].str.replace(' years old', '')

combined_data['Grade and Age'] = both[0].str.replace('Grade ', '') + both[1].str.replace(' years old', '')

In [53]:
combined_data

   Grade and Age # Friends
0           9 15         4
1           5 11         1
2            2 8         8
3           5 11        10
4           7 13        18
..           ...       ...
95         10 16        17
96         10 16        13
97         10 16        13
98         10 16         6
99         11 17         6

[100 rows x 2 columns]

In [54]:
a = 'abcdefghij'

In [55]:
import re

In [63]:
a.re.search(, a)

SyntaxError: EOL while scanning string literal (<ipython-input-63-2337d8448af5>, line 1)